#+title: Vibecut: a vibe-coded video editor

* What is this?
This is a long-term experiment to see how viable vibe-coding with AI
agents is in 2026.

* The Goal
Create an advanced desktop application for video editing. Simpler than
Final Cut, but more advanced than iMovie. We want to use minimal
amount of manual code typing, and prefer written or spoken prompts.

* Tech Stack
- GNU+Linux
- C++23
- CMake
- GLFW + OpenGL 4
- ImGui
- ffmpeg

* Building

** Dependencies

Install GLFW on your Linux distribution:

#+begin_src bash
# Arch Linux
sudo pacman -S glfw

# Ubuntu/Debian
sudo apt install libglfw3-dev

# Fedora
sudo dnf install glfw-devel
#+end_src

** Clone and Build

#+begin_src bash
git clone --recurse-submodules https://github.com/lszl84/vibecut.git
cd vibecut
cmake -B build
cmake --build build
./build/vibecut
#+end_src

If you already cloned without submodules:

#+begin_src bash
git submodule update --init
#+end_src

* Tasks
We'll track the time spent on the tasks below:
** Initial Setup
Git Setup, AGENTS.md, workflow changes, etc.
:LOGBOOK:
CLOCK: [2026-01-04 Sun 15:10]--[2026-01-04 Sun 15:16] =>  0:06
CLOCK: [2026-01-04 Sun 14:57]--[2026-01-04 Sun 15:04] =>  0:07
:END:
** Vibe coding
:LOGBOOK:
CLOCK: [2026-01-04 Sun 15:19]--[2026-01-04 Sun 15:22] =>  0:03
:END:
Typing or speaking prompts, babysiting Agents, testing the features
implemented by agents, etc.
** Manual coding
Adding/changing code by hand, debugging, etc.

* Time Tracking

#+BEGIN: clocktable :maxlevel nil :scope file :block nil
#+CAPTION: Clock summary at [2026-01-04 Sun 16:22]
| Headline          | Time |      |
|-------------------+------+------|
| *Total time*        | *0:16* |      |
|-------------------+------+------|
| Tasks             | 0:16 |      |
| \_  Initial Setup |      | 0:13 |
| \_  Vibe coding   |      | 0:03 |
#+END:

* Devlog
** Day 1
Set up the GitHub project with README.org and AGENTS.mg. Added basic
CMakeLists.txt and program code showing a window with a button.
